#pragma once

#include "source2sdk/source2gen/source2gen.hpp"
#include <cstddef>
#include <cstdint>
#include "source2sdk/client/CBaseModifier.hpp"
#include "source2sdk/client/CLevelProgressionDefinition.hpp"
#include "source2sdk/client/CitadelItemVData.hpp"

// /////////////////////////////////////////////////////////////
// Module: client
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk
{
    namespace client
    {
        // Registered alignment: 0x8
        // Alignment: 0x8
        // Standard-layout class: false
        // Size: 0x18c8
        // Has VTable
        // 
        // static metadata: MGetKV3ClassDefaults
        #pragma pack(push, 1)
        class CCitadel_CosmeticItem_Snowball_VData : public source2sdk::client::CitadelItemVData
        {
        public:
            // metadata: MPropertyStartGroup "Snowball Gameplay"
            float m_flMaxLevelDebuffDuration; // 0x1790            
            uint8_t _pad1794[0x4]; // 0x1794
            source2sdk::client::CLevelProgressionDefinition m_progressionDamage; // 0x1798            
            source2sdk::client::CLevelProgressionDefinition m_progressionCooldown; // 0x17c8            
            source2sdk::client::CLevelProgressionDefinition m_progressionSpeed; // 0x17f8            
            source2sdk::client::CLevelProgressionDefinition m_progressionCharges; // 0x1828            
            source2sdk::client::CLevelProgressionDefinition m_progressionSnowballCount; // 0x1858            
            source2sdk::client::CLevelProgressionDefinition m_progressionRadius; // 0x1888            
            // metadata: MPropertyStartGroup "Modifiers"
            // m_SnowballModifier has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CEmbeddedSubclass<source2sdk::client::CBaseModifier> m_SnowballModifier;
            char m_SnowballModifier[0x10]; // 0x18b8            
        };
        #pragma pack(pop)
        
        // Cannot assert offsets of fields in CCitadel_CosmeticItem_Snowball_VData because it is not a standard-layout class
        
        static_assert(sizeof(source2sdk::client::CCitadel_CosmeticItem_Snowball_VData) == 0x18c8);
    };
};
