#pragma once

#include "source2sdk/source2gen/source2gen.hpp"
#include <cstddef>
#include <cstdint>
#include "source2sdk/client/CCitadelModifier.hpp"
#include "source2sdk/client/CCitadelModifierVData.hpp"
#include "source2sdk/resourcesystem/InfoForResourceTypeCModel.hpp"
#include "source2sdk/resourcesystem/InfoForResourceTypeIParticleSystemDefinition.hpp"

// /////////////////////////////////////////////////////////////
// Module: client
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk
{
    namespace client
    {
        // Registered alignment: 0x8
        // Alignment: 0x8
        // Standard-layout class: false
        // Size: 0xa60
        // Has VTable
        // 
        // static metadata: MGetKV3ClassDefaults
        #pragma pack(push, 1)
        class CModifierRestorativeGooVData : public source2sdk::client::CCitadelModifierVData
        {
        public:
            // metadata: MPropertyStartGroup "Visuals"
            // m_RestorativeGooEndParticle has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CResourceNameTyped<CWeakHandle<source2sdk::resourcesystem::InfoForResourceTypeIParticleSystemDefinition>> m_RestorativeGooEndParticle;
            char m_RestorativeGooEndParticle[0xe0]; // 0x760            
            // m_ModelName has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CResourceNameTyped<CWeakHandle<source2sdk::resourcesystem::InfoForResourceTypeCModel>> m_ModelName;
            char m_ModelName[0xe0]; // 0x840            
            // m_SelfCubeModelName has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CResourceNameTyped<CWeakHandle<source2sdk::resourcesystem::InfoForResourceTypeCModel>> m_SelfCubeModelName;
            char m_SelfCubeModelName[0xe0]; // 0x920            
            // metadata: MPropertyStartGroup "Modifiers"
            // m_BreakoutProgressBarModifier has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CEmbeddedSubclass<source2sdk::client::CCitadelModifier> m_BreakoutProgressBarModifier;
            char m_BreakoutProgressBarModifier[0x10]; // 0xa00            
            // m_PostCubeBuffModifier has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CEmbeddedSubclass<source2sdk::client::CCitadelModifier> m_PostCubeBuffModifier;
            char m_PostCubeBuffModifier[0x10]; // 0xa10            
            // metadata: MPropertyStartGroup "Sounds"
            CSoundEventName m_NonTargetLoopingSound; // 0xa20            
            CSoundEventName m_TargetLoopingSound; // 0xa30            
            CSoundEventName m_LightMeleeImpact; // 0xa40            
            CSoundEventName m_HeavyMeleeImpact; // 0xa50            
        };
        #pragma pack(pop)
        
        // Cannot assert offsets of fields in CModifierRestorativeGooVData because it is not a standard-layout class
        
        static_assert(sizeof(source2sdk::client::CModifierRestorativeGooVData) == 0xa60);
    };
};
