#pragma once

#include "source2sdk/source2gen/source2gen.hpp"
#include <cstddef>
#include <cstdint>
#include "source2sdk/resourcesystem/InfoForResourceTypeIParticleSystemDefinition.hpp"
#include "source2sdk/server/CCitadelModifierVData.hpp"

// /////////////////////////////////////////////////////////////
// Module: server
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk
{
    namespace server
    {
        // Registered alignment: 0x8
        // Alignment: 0x8
        // Standard-layout class: false
        // Size: 0xce0
        // Has VTable
        // 
        // static metadata: MGetKV3ClassDefaults
        #pragma pack(push, 1)
        class CModifierStormCloudVData : public source2sdk::server::CCitadelModifierVData
        {
        public:
            // metadata: MPropertyStartGroup "Visuals"
            // m_ZapFriendly has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CResourceNameTyped<CWeakHandle<source2sdk::resourcesystem::InfoForResourceTypeIParticleSystemDefinition>> m_ZapFriendly;
            char m_ZapFriendly[0xe0]; // 0x760            
            // m_DrawFriendly has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CResourceNameTyped<CWeakHandle<source2sdk::resourcesystem::InfoForResourceTypeIParticleSystemDefinition>> m_DrawFriendly;
            char m_DrawFriendly[0xe0]; // 0x840            
            // m_AoEFriendly has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CResourceNameTyped<CWeakHandle<source2sdk::resourcesystem::InfoForResourceTypeIParticleSystemDefinition>> m_AoEFriendly;
            char m_AoEFriendly[0xe0]; // 0x920            
            // m_ZapEnemy has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CResourceNameTyped<CWeakHandle<source2sdk::resourcesystem::InfoForResourceTypeIParticleSystemDefinition>> m_ZapEnemy;
            char m_ZapEnemy[0xe0]; // 0xa00            
            // m_DrawEnemy has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CResourceNameTyped<CWeakHandle<source2sdk::resourcesystem::InfoForResourceTypeIParticleSystemDefinition>> m_DrawEnemy;
            char m_DrawEnemy[0xe0]; // 0xae0            
            // m_AoEEnemy has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CResourceNameTyped<CWeakHandle<source2sdk::resourcesystem::InfoForResourceTypeIParticleSystemDefinition>> m_AoEEnemy;
            char m_AoEEnemy[0xe0]; // 0xbc0            
            // metadata: MPropertyStartGroup "Sounds"
            CSoundEventName m_strChannelEndingSoonSound; // 0xca0            
            CSoundEventName m_strChannelFinishedSound; // 0xcb0            
            CSoundEventName m_strDamageRecievedSound; // 0xcc0            
            CSoundEventName m_strAmbientZapSound; // 0xcd0            
        };
        #pragma pack(pop)
        
        // Cannot assert offsets of fields in CModifierStormCloudVData because it is not a standard-layout class
        
        static_assert(sizeof(source2sdk::server::CModifierStormCloudVData) == 0xce0);
    };
};
