#pragma once

#include "source2sdk/source2gen/source2gen.hpp"
#include <cstddef>
#include <cstdint>
#include "source2sdk/server/CBaseTrigger.hpp"
namespace source2sdk
{
    namespace server
    {
        struct CBaseEntity;
    };
};

// /////////////////////////////////////////////////////////////
// Module: server
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk
{
    namespace server
    {
        // Registered alignment: 0x8
        // Alignment: 0x8
        // Standard-layout class: false
        // Size: 0xd38
        // Has VTable
        #pragma pack(push, 1)
        class CTriggerSndSosOpvar : public source2sdk::server::CBaseTrigger
        {
        public:
            // m_hTouchingPlayers has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CUtlVector<CHandle<source2sdk::server::CBaseEntity>> m_hTouchingPlayers;
            char m_hTouchingPlayers[0x18]; // 0x9d8            
            Vector m_flPosition; // 0x9f0            
            float m_flCenterSize; // 0x9fc            
            float m_flMinVal; // 0xa00            
            float m_flMaxVal; // 0xa04            
            CUtlSymbolLarge m_opvarName; // 0xa08            
            CUtlSymbolLarge m_stackName; // 0xa10            
            CUtlSymbolLarge m_operatorName; // 0xa18            
            bool m_bVolIs2D; // 0xa20            
            char m_opvarNameChar[256]; // 0xa21            
            char m_stackNameChar[256]; // 0xb21            
            char m_operatorNameChar[256]; // 0xc21            
            uint8_t _pad0d21[0x3]; // 0xd21
            Vector m_VecNormPos; // 0xd24            
            float m_flNormCenterSize; // 0xd30            
            uint8_t _pad0d34[0x4];
            
            // Datamap fields:
            // void CTriggerSndSosOpvarSndSosTriggerOpvarWaitOver; // 0x0
            // void m_opvarNameChar; // 0xa21
            // void m_stackNameChar; // 0xb21
            // void m_operatorNameChar; // 0xc21
        };
        #pragma pack(pop)
        
        // Cannot assert offsets of fields in CTriggerSndSosOpvar because it is not a standard-layout class
        
        static_assert(sizeof(source2sdk::server::CTriggerSndSosOpvar) == 0xd38);
    };
};
