#pragma once

#include "source2sdk/source2gen/source2gen.hpp"
#include <cstddef>
#include <cstdint>
#include "source2sdk/entity2/CEntityIOOutput.hpp"
#include "source2sdk/modellib/AttachmentHandle_t.hpp"
#include "source2sdk/server/CBaseTrigger.hpp"
#include "source2sdk/server/lerpdata_t.hpp"
namespace source2sdk
{
    namespace server
    {
        struct CBaseEntity;
    };
};

// /////////////////////////////////////////////////////////////
// Module: server
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk
{
    namespace server
    {
        // Registered alignment: 0x8
        // Alignment: 0x8
        // Standard-layout class: false
        // Size: 0xa80
        // Has VTable
        #pragma pack(push, 1)
        class CTriggerLerpObject : public source2sdk::server::CBaseTrigger
        {
        public:
            CUtlSymbolLarge m_iszLerpTarget; // 0x9d8            
            // m_hLerpTarget has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hLerpTarget;
            char m_hLerpTarget[0x4]; // 0x9e0            
            uint8_t _pad09e4[0x4]; // 0x9e4
            CUtlSymbolLarge m_iszLerpTargetAttachment; // 0x9e8            
            source2sdk::modellib::AttachmentHandle_t m_hLerpTargetAttachment; // 0x9f0            
            uint8_t _pad09f1[0x3]; // 0x9f1
            float m_flLerpDuration; // 0x9f4            
            bool m_bLerpRestoreMoveType; // 0x9f8            
            bool m_bSingleLerpObject; // 0x9f9            
            uint8_t _pad09fa[0x6]; // 0x9fa
            // m_vecLerpingObjects has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CUtlVector<source2sdk::server::lerpdata_t> m_vecLerpingObjects;
            char m_vecLerpingObjects[0x18]; // 0xa00            
            CUtlSymbolLarge m_iszLerpEffect; // 0xa18            
            CUtlSymbolLarge m_iszLerpSound; // 0xa20            
            bool m_bAttachTouchingObject; // 0xa28            
            uint8_t _pad0a29[0x3]; // 0xa29
            // m_hEntityToWaitForDisconnect has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hEntityToWaitForDisconnect;
            char m_hEntityToWaitForDisconnect[0x4]; // 0xa2c            
            source2sdk::entity2::CEntityIOOutput m_OnLerpStarted; // 0xa30            
            source2sdk::entity2::CEntityIOOutput m_OnLerpFinished; // 0xa58            
            
            // Datamap fields:
            // void CTriggerLerpObjectLerpThink; // 0x0
            // void CTriggerLerpObjectUnsetWaitForEntity; // 0x0
        };
        #pragma pack(pop)
        
        // Cannot assert offsets of fields in CTriggerLerpObject because it is not a standard-layout class
        
        static_assert(sizeof(source2sdk::server::CTriggerLerpObject) == 0xa80);
    };
};
